#include <stdio.h>

int main()
{
	int a, p, p2;
	scanf("%d", &a);
	for(int i = 1; i <= a; i++)
	{
		if(i < 10)
		{
			if(i == 3 || i == 6 || i == 9) printf("짝 ");
			else printf("%d ", i);
		}
		else
		{
			p = i%10;
			p2 = i/10;
			if(p2 == 3 || p2 == 6 || p2 == 9) 
			{
				printf("짝");
				if(p == 3 || p == 6 || p == 9) printf("짝 "); 
				else printf(" ");
			}
			else
			{
				if(p == 3 || p == 6 || p == 9) printf("짝 ");
				else printf("%d ", i); 
			}

		}
	}
}

/*3 6 9 게임은 1부터 시작하여 한명씩 돌아가면서 숫자를 말하고,
3 6 9가 포함된 숫자의 차례일때 3이 들어간 횟수만큼 박수를 치는 게임이다.

여기서 문제, 1을 시작으로 사용자가 입력한 정수까지 3 6 9 게임이 진행될때, 진행과정을 출력하기

예) 만약 14가 입력된다면, 1 2 짝 4 5 짝 7 8 짝 10 11 12 짝 14 와 같이 출력된다.
(만약 두번쳐야 할때(36)에는 짝짝 와 같이 출력하면 된다.*/
